emacs_init.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-06-16 Fri 12:37 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>My Emacs Configuration</title>
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">My Emacs Configuration</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org08f3cdd">1. Define Header</a></li>
<li><a href="#orga601c0a">2. Check Preconditions</a>
<ul>
<li><a href="#org9fc0eac">2.1. JSON Support</a></li>
</ul>
</li>
<li><a href="#orgc1a2811">3. Enable Desktop Preservation</a></li>
<li><a href="#orgb34c1f1">4. Customize Styling</a>
<ul>
<li><a href="#org3a415c3">4.1. Show Some Stuff</a></li>
<li><a href="#org74af343">4.2. Hide Some Stuff</a></li>
<li><a href="#org0bb4dbe">4.3. Go Dark</a></li>
</ul>
</li>
<li><a href="#org6c42044">5. Define Self Inserting Characters</a></li>
<li><a href="#org4e68770">6. Bind Some Low-Level Commands</a></li>
<li><a href="#org7db444a">7. Provide Some Basic Editing</a>
<ul>
<li><a href="#orgbe69b11">7.1. Insert Content</a></li>
<li><a href="#org5faae42">7.2. Remove Content</a></li>
<li><a href="#orgfed016d">7.3. Support Moving Point Around Within a Buffer</a></li>
<li><a href="#org5a94cde">7.4. Change View of Buffer</a></li>
<li><a href="#org45ea22a">7.5. Play With Mark</a></li>
<li><a href="#orgf03abc9">7.6. Work with Kill Ring</a></li>
</ul>
</li>
<li><a href="#org80cf6f4">8. Generate Content</a></li>
<li><a href="#orga528ef0">9. Searching and Potentially Replacing</a></li>
<li><a href="#orgc0b6b5c">10. Support Some Inter-Process Communication</a>
<ul>
<li><a href="#org0a147be">10.1. Support Invoking of External Commands</a></li>
<li><a href="#org571b9be">10.2. Handle Escape Sequences from External Commands</a></li>
</ul>
</li>
<li><a href="#org0bdc3fa">11. Manage View Objects</a></li>
<li><a href="#org86dddf3">12. Help Me!</a></li>
<li><a href="#org11273b6">13. Define Some Minibuffer Bindings</a></li>
<li><a href="#org6bc0e90">14. Define Some Navigation Through a Project</a></li>
<li><a href="#org8f8599c">15. Configure Org Mode</a></li>
<li><a href="#orgff24eb4">16. Configure Dired Mode</a></li>
<li><a href="#org4cef713">17. Configure Org Agenda</a></li>
<li><a href="#org6d7ebd1">18. Configure hexl Mode</a></li>
<li><a href="#orgf960c05">19. Configure Info Mode</a></li>
<li><a href="#org4cb938e">20. Manage Environment for Called Commands</a>
<ul>
<li><a href="#orgb56d76e">20.1. Customization Group</a>
<ul>
<li><a href="#org388b67e">20.1.1. Expand Using Shell</a></li>
<li><a href="#orgadb7876">20.1.2. Transplants</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<p>
I use my Emacs configuration both as a means to customize it and to
document standard behavior. As a result much of it will strictly
unnecessary.
</p>

<p>
I'll also be looking to build up the configuration incrementally along
with supporting knowledge and will start with integrating desired
functionality directly into this file rather than pulling in external
packages. This ties in with an overall goal I have in software in
general to make consistent reuse of abstractions, and also can
hopefully address a concern I've had with Emacs in particular in the
past where it felt as though there was both too much code floating
around the ecosystem and too little readily composable functionality.
</p>

<p>
I'm currently using `^-` as a prefix for my local definitions.
This is inherited from a past project where I started to create a lot
of macros and since the "macs" in Emacs is for macros I was thinking
of it as macros squared&#x2026;so `^-` is in the spirit of that while also
being nice and short.
</p>

<p>
Over time I'll likely also look to evolve the configuration so that it
is increasingly declarative data structures operated upon by fewer
functions. This may ease reuse of the same configuration across
multiple targets as the number of operations to support will be reduced.
</p>

<div id="outline-container-org08f3cdd" class="outline-2">
<h2 id="org08f3cdd"><span class="section-number-2">1.</span> Define Header</h2>
<div class="outline-text-2" id="text-1">
<p>
Define some standard header boilerplate like copyright&#x2026;
most significantly define lexical binding.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
;;; init.el -- Configure emacs to my liking. -*- lexical-binding: t; -*-

;; Copyright (C) 2023 Matt Whipple &lt;mattwhipple@acm.org&gt;

;; Author: Matt Whipple &lt;mattwhipple@acm.org&gt;
;; Maintainer: Matt Whiple &lt;mattwhipple@acm.org&gt;
;; Keywords: config
;; Package: ^-config
;; Package-Version: NA
;; Package-Requires: ((emacs "29.1"))
;; Filename: init.el

;; This file is not part of GNU Emacs.

;; This is free software: you can redistribute it and/or modify
;; it under the terms of the GNU General Public License as published by
;; the Free Software Foundation, either version 3 of the License, or
;; (at your option) any later version.

;; This software is distributed in the hope that it will be useful,
;; but WITHOUT ANY WARRANTY; without even the implied warranty of
;; MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
;; GNU General Public License for more details.

;; You should have received a copy of the GNU General Public License
;; along with this file.  If not, see &lt;http://www.gnu.org/licenses/&gt;.

;;; Commentary:

;; This file will collect my configuration and documentation of emacs behavior,
;; along with being the initial location of any extensions on which I work.

;;; Code:

</pre>
</div>
</div>
</div>

<div id="outline-container-orga601c0a" class="outline-2">
<h2 id="orga601c0a"><span class="section-number-2">2.</span> Check Preconditions</h2>
<div class="outline-text-2" id="text-2">
<p>
I'll be making use of whatever seems readily available rather than
carefully tracking what features are available on what systems, but as
the lack of certain capabilities translate into errors on some system
or other I'll add tests with more helpful messages here. If any of
this code ends up being split out into libraries this should be
handled with more discipline (and compatibility options should be
explored).
</p>
</div>

<div id="outline-container-org9fc0eac" class="outline-3">
<h3 id="org9fc0eac"><span class="section-number-3">2.1.</span> JSON Support</h3>
<div class="outline-text-3" id="text-2-1">
<p>
This is required for EAF stuff and seems generally useful.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(unless (fboundp #'json-parse-buffer)
  (warn "Emacs does not have JSON support!"))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgc1a2811" class="outline-2">
<h2 id="orgc1a2811"><span class="section-number-2">3.</span> Enable Desktop Preservation</h2>
<div class="outline-text-2" id="text-3">
<p>
Use desktop mode to save and restore desktops across invocations.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(desktop-save-mode)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb34c1f1" class="outline-2">
<h2 id="orgb34c1f1"><span class="section-number-2">4.</span> Customize Styling</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org3a415c3" class="outline-3">
<h3 id="org3a415c3"><span class="section-number-3">4.1.</span> Show Some Stuff</h3>
<div class="outline-text-3" id="text-4-1">
<p>
I often have Emacs running full-screen so it's nice if it just provides
me info that I need in the status bar such as what time it is and how
much time until my battery will die and maybe other things that aren't
time related.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(display-battery-mode)
(display-time)
(setq display-time-day-and-date t)
</pre>
</div>
</div>
</div>

<div id="outline-container-org74af343" class="outline-3">
<h3 id="org74af343"><span class="section-number-3">4.2.</span> Hide Some Stuff</h3>
<div class="outline-text-3" id="text-4-2">
<p>
Currently I'm very keyboard oriented and don't want to waste previous
screen real estate so I'd rather get rid of user interface elements
intended for other forms of interaction. I may revisit this as I look
at using Emacs across a wider range of devices.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(tool-bar-mode -1)
(menu-bar-mode -1)
</pre>
</div>
</div>
</div>

<div id="outline-container-org0bb4dbe" class="outline-3">
<h3 id="org0bb4dbe"><span class="section-number-3">4.3.</span> Go Dark</h3>
<div class="outline-text-3" id="text-4-3">
<p>
I (like many people) generally prefer themes with dark
backgrounds. Emacs in particular looks particularly primitive with the
default white GUI background whereas on black it looks at least a bit
more retro. While I may be tempted at some point to fiddle with this a
bit more (especially given that it comes with some disclaimers) I'll
start with some code I stumbled upon within the Emacs code base (I
think frame.el&#x2026;I should link it when I come across it again).
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(define-minor-mode dark-mode
  "Use light text on dark background."  
  :global t
  :group 'faces
  (when (eq dark-mode
            (eq 'light (frame--current-background-mode (selected-frame))))
    ;; FIXME: Change the face's SPEC instead?
    (set-face-attribute 'default nil
                        :foreground (face-attribute 'default :background)
                        :background (face-attribute 'default :foreground))
   (frame-set-background-mode (selected-frame))))
(dark-mode)
</pre>
</div>
</div>
</div>
</div>
