emacs_init.org
** Define Self Inserting Characters

Define and bind chose keys that result in the associated character
being inserted. This is particularly standard behavior as provided by
the terminal though Emacs does add some custom logic. These are
defined in a variable for subsequent specialization (there is likely a
more idiomatic way to do that such as using remap but I haven't gotten
that far yet.

This makes use of the relatively new `keymap-set` function which
replaces `define-key`. Elsewhere will primarily use the `bind-key`
family of macros but this make more direct use of the core
functionality as it lends itself more readily to composition (and
there's no clear value in using anything fancier). I'd generally be on
the fence about using `bind-key` but since it's now included in Emacs
it's hard to resist.

#+BEGIN_SRC emacs-lisp :tangle init.el
  (setq self-insert-keys
	'(
	  "a" "b" "c" "d" "e" "f" "g" "h" "i" "j" "k" "l" "m"			   
	  "A" "B" "C" "D" "E" "F" "G" "H" "I" "J" "K" "L" "M"
	  "n" "o" "p" "q" "r" "s" "t" "u" "v" "w" "x" "y" "z"
	  "N" "O" "P" "Q" "R" "S" "T" "U" "V" "W" "X" "Y" "Z"
	  "0" "1" "2" "3" "4" "5" "6" "7" "8" "9" "." "-" "$"
	  "SPC" "=" "_" "*" "\"" "'" "`" "+" "~" "?"
	  "!" "@" "#" "%" "^" "&" "|" "," ";" ":"
	  "(" ")" "{" "}" "[" "]" "<" ">" "/" "\\"
	  ))
  (dolist (k self-insert-keys)
    (apply #'keymap-set (list global-map k #'self-insert-command)))
#+END_SRC

** Bind Some Low-Level Commands

Define some functions that seem relatively fundamental to dealing with
commands in general.

#+BEGIN_SRC emacs-lisp :tangle init.el
  (bind-keys :map global-map
	     ("C-g" . keyboard-quit)
	     ("M-x" . execute-extended-command))
#+END_SRC

** Provide Some Basic Editing
*** Insert Content

#+BEGIN_SRC emacs-lisp :tangle init.el
  (bind-keys :map global-map
	     ("RET" . newline)
	     ("TAB" . indent-for-tab-command)
	     ("C-o" . open-line))
#+END_SRC

*** Remove Content

#+BEGIN_SRC emacs-lisp :tangle init.el
    (bind-keys :map global-map
	       ("DEL"  . backward-delete-char-untabify)
	       ("C-d" .  delete-char)
	       ("M-\\" . delete-horizontal-space)
	       ("M-z" . zap-up-to-char))
#+END_SRC

*** Support Moving Point Around Within a Buffer

#+BEGIN_SRC emacs-lisp :tangle init.el
  (bind-keys :map global-map
	     ("C-f" . forward-char)
	     ("C-b" . backward-char)
	     ("C-n" . next-line)
	     ("C-p" . previous-line)
	     ("C-e" . move-end-of-line)
	     ("C-a" . move-beginning-of-line)
	     ("M-f" . forward-word)
	     ("M-b" . backward-word)
	     ("M->" . end-of-buffer)
	     ("M-<" . beginning-of-buffer)
	     ("M-}" . forward-paragraph)
	     ("M-{" . backward-paragraph)
	     ("C-v" . scroll-up-command)
	     ("M-v" . scroll-down-command))
#+END_SRC

*** Change View of Buffer

#+BEGIN_SRC emacs-lisp :tangle init.el
  (bind-keys :map global-map
	     ("C-l" . recenter-top-bottom))
#+END_SRC

*** Play With Mark

#+BEGIN_SRC emacs-lisp :tangle init.el
  (bind-keys :map global-map
	     ("C-SPC" . set-mark-command)
	     ("C-x h" . mark-whole-buffer))
#+END_SRC

*** Work with Kill Ring

#+BEGIN_SRC emacs-lisp :tangle init.el
  (bind-keys :map global-map
	     ("C-y" . yank)
	     ("C-k" . kill-line)
	     ("M-w" . kill-ring-save))
#+END_SRC

** Generate Content

#+BEGIN_SRC emacs-lisp :tangle init.el
  (bind-keys :map global-map
	     ("M-/" . dabbrev-expand))
#+END_SRC

** Searching and Potentially Replacing

#+BEGIN_SRC emacs-lisp :tangle init.el
  (bind-keys :map global-map
	     ("C-s" . isearch-forward)
	     ("M-%" . query-replace)
	     ("M-." . xref-find-definitions))
#+END_SRC

** Support Some Inter-Process Communication
*** Support Invoking of External Commands

#+BEGIN_SRC emacs-lisp :tangle init.el
  (bind-keys :map global-map
	     ("M-!" . shell-command))
#+END_SRC

*** Handle Escape Sequences from External Commands

#+BEGIN_SRC emacs-lisp :tangle init.el
  (add-hook 'compilation-filter-hook 'ansi-color-compilation-filter)
#+END_SRC

** Manage View Objects

Deal with buffers and windows. I'm currently lumping these together
and customizing their binding a bit to make use of the `C-M`
modifier combination. This is an experimental shift, but in a past
adoption of Emacs I remember doing something or other to rebind window
resizing such that it did not require a chain and as these operations
are so fundamental this seems like a potentially nice route.

These are global and since the prefix is likely used elsewhere they
are forced using `bind-keys*` to stick them in the override map.

#+BEGIN_SRC emacs-lisp :tangle init.el
  (bind-keys* ("C-M-n" . next-buffer)
	      ("C-M-<right>" . next-buffer)
	      ("C-M-p" . previous-buffer)
	      ("C-M-<left>" . previous-buffer)
	      ("C-M-b" . switch-to-buffer)
	      ("C-M-k" . kill-buffer)
	      ("C-M-l" . list-buffers)
	      ("C-M-s" . save-buffer)
	      ("C-M-0" . delete-window)
	      ("C-M-1" . delete-other-windows)
	      ("C-M-2" . split-window-below)
	      ("C-M-3" . split-window-right)
	      ("C-M-o" . other-window)
	      ("C-M-}" . enlarge-window-horizontally)
	      ("C-M-{" . shrink-window-horizontally)
	      ("C-M-]" . enlarge-window)
	      ("C-M-[" . shrink-window))
#+END_SRC

** Help Me!

#+BEGIN_SRC emacs-lisp :tangle init.el
    (bind-keys :prefix "C-h"
	       :prefix-map help-map
	       :prefix-docstring "Help me!"
	       ("b" . describe-bindings)
	       ("f" . describe-function)
	       ("i" . info)
	       ("k" . describe-key)
	       ("l" . view-lossage)
	       ("m" . describe-mode)
	       ("v" . describe-variable)
	       ("w" . where-is))
#+END_SRC

** Define Some Minibuffer Bindings

#+BEGIN_SRC emacs-lisp :tangle init.el
  (bind-keys :map minibuffer-mode-map
	     ("TAB" . minibuffer-complete)
	     ("RET" . exit-minibuffer)
	     ("M-n" . next-history-element)
	     ("M-p" . previous-history-element))
#+END_SRC

