emacs_init.html

<div id="outline-container-org6c42044" class="outline-2">
<h2 id="org6c42044"><span class="section-number-2">5.</span> Define Self Inserting Characters</h2>
<div class="outline-text-2" id="text-5">
<p>
Define and bind chose keys that result in the associated character
being inserted. This is particularly standard behavior as provided by
the terminal though Emacs does add some custom logic. These are
defined in a variable for subsequent specialization (there is likely a
more idiomatic way to do that such as using remap but I haven't gotten
that far yet.
</p>

<p>
This makes use of the relatively new `keymap-set` function which
replaces `define-key`. Elsewhere will primarily use the `bind-key`
family of macros but this make more direct use of the core
functionality as it lends itself more readily to composition (and
there's no clear value in using anything fancier). I'd generally be on
the fence about using `bind-key` but since it's now included in Emacs
it's hard to resist.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(setq self-insert-keys
      '(
        "a" "b" "c" "d" "e" "f" "g" "h" "i" "j" "k" "l" "m"			   
        "A" "B" "C" "D" "E" "F" "G" "H" "I" "J" "K" "L" "M"
        "n" "o" "p" "q" "r" "s" "t" "u" "v" "w" "x" "y" "z"
        "N" "O" "P" "Q" "R" "S" "T" "U" "V" "W" "X" "Y" "Z"
        "0" "1" "2" "3" "4" "5" "6" "7" "8" "9" "." "-" "$"
        "SPC" "=" "_" "*" "\"" "'" "`" "+" "~" "?"
        "!" "@" "#" "%" "^" "&amp;" "|" "," ";" ":"
        "(" ")" "{" "}" "[" "]" "&lt;" "&gt;" "/" "\\"
        ))
(dolist (k self-insert-keys)
  (apply #'keymap-set (list global-map k #'self-insert-command)))
</pre>
</div>
</div>
</div>

<div id="outline-container-org4e68770" class="outline-2">
<h2 id="org4e68770"><span class="section-number-2">6.</span> Bind Some Low-Level Commands</h2>
<div class="outline-text-2" id="text-6">
<p>
Define some functions that seem relatively fundamental to dealing with
commands in general.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(bind-keys :map global-map
           ("C-g" . keyboard-quit)
           ("M-x" . execute-extended-command))
</pre>
</div>
</div>
</div>

<div id="outline-container-org7db444a" class="outline-2">
<h2 id="org7db444a"><span class="section-number-2">7.</span> Provide Some Basic Editing</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-orgbe69b11" class="outline-3">
<h3 id="orgbe69b11"><span class="section-number-3">7.1.</span> Insert Content</h3>
<div class="outline-text-3" id="text-7-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(bind-keys :map global-map
           ("RET" . newline)
           ("TAB" . indent-for-tab-command)
           ("C-o" . open-line))
</pre>
</div>
</div>
</div>

<div id="outline-container-org5faae42" class="outline-3">
<h3 id="org5faae42"><span class="section-number-3">7.2.</span> Remove Content</h3>
<div class="outline-text-3" id="text-7-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(bind-keys :map global-map
           ("DEL"  . backward-delete-char-untabify)
           ("C-d" .  delete-char)
           ("M-\\" . delete-horizontal-space)
           ("M-z" . zap-up-to-char))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgfed016d" class="outline-3">
<h3 id="orgfed016d"><span class="section-number-3">7.3.</span> Support Moving Point Around Within a Buffer</h3>
<div class="outline-text-3" id="text-7-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(bind-keys :map global-map
           ("C-f" . forward-char)
           ("C-b" . backward-char)
           ("C-n" . next-line)
           ("C-p" . previous-line)
           ("C-e" . move-end-of-line)
           ("C-a" . move-beginning-of-line)
           ("M-f" . forward-word)
           ("M-b" . backward-word)
           ("M-&gt;" . end-of-buffer)
           ("M-&lt;" . beginning-of-buffer)
           ("M-}" . forward-paragraph)
           ("M-{" . backward-paragraph)
           ("C-v" . scroll-up-command)
           ("M-v" . scroll-down-command))
</pre>
</div>
</div>
</div>

<div id="outline-container-org5a94cde" class="outline-3">
<h3 id="org5a94cde"><span class="section-number-3">7.4.</span> Change View of Buffer</h3>
<div class="outline-text-3" id="text-7-4">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(bind-keys :map global-map
           ("C-l" . recenter-top-bottom))
</pre>
</div>
</div>
</div>

<div id="outline-container-org45ea22a" class="outline-3">
<h3 id="org45ea22a"><span class="section-number-3">7.5.</span> Play With Mark</h3>
<div class="outline-text-3" id="text-7-5">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(bind-keys :map global-map
           ("C-SPC" . set-mark-command)
           ("C-x h" . mark-whole-buffer))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf03abc9" class="outline-3">
<h3 id="orgf03abc9"><span class="section-number-3">7.6.</span> Work with Kill Ring</h3>
<div class="outline-text-3" id="text-7-6">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(bind-keys :map global-map
           ("C-y" . yank)
           ("C-k" . kill-line)
           ("M-w" . kill-ring-save))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org80cf6f4" class="outline-2">
<h2 id="org80cf6f4"><span class="section-number-2">8.</span> Generate Content</h2>
<div class="outline-text-2" id="text-8">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(bind-keys :map global-map
           ("M-/" . dabbrev-expand))
</pre>
</div>
</div>
</div>

<div id="outline-container-orga528ef0" class="outline-2">
<h2 id="orga528ef0"><span class="section-number-2">9.</span> Searching and Potentially Replacing</h2>
<div class="outline-text-2" id="text-9">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(bind-keys :map global-map
           ("C-s" . isearch-forward)
           ("M-%" . query-replace)
           ("M-." . xref-find-definitions))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc0b6b5c" class="outline-2">
<h2 id="orgc0b6b5c"><span class="section-number-2">10.</span> Support Some Inter-Process Communication</h2>
<div class="outline-text-2" id="text-10">
</div>
<div id="outline-container-org0a147be" class="outline-3">
<h3 id="org0a147be"><span class="section-number-3">10.1.</span> Support Invoking of External Commands</h3>
<div class="outline-text-3" id="text-10-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(bind-keys :map global-map
           ("M-!" . shell-command))
</pre>
</div>
</div>
</div>

<div id="outline-container-org571b9be" class="outline-3">
<h3 id="org571b9be"><span class="section-number-3">10.2.</span> Handle Escape Sequences from External Commands</h3>
<div class="outline-text-3" id="text-10-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(add-hook 'compilation-filter-hook 'ansi-color-compilation-filter)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org0bdc3fa" class="outline-2">
<h2 id="org0bdc3fa"><span class="section-number-2">11.</span> Manage View Objects</h2>
<div class="outline-text-2" id="text-11">
<p>
Deal with buffers and windows. I'm currently lumping these together
and customizing their binding a bit to make use of the `C-M`
modifier combination. This is an experimental shift, but in a past
adoption of Emacs I remember doing something or other to rebind window
resizing such that it did not require a chain and as these operations
are so fundamental this seems like a potentially nice route.
</p>

<p>
These are global and since the prefix is likely used elsewhere they
are forced using `bind-keys*` to stick them in the override map.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(bind-keys* ("C-M-n" . next-buffer)
            ("C-M-&lt;right&gt;" . next-buffer)
            ("C-M-p" . previous-buffer)
            ("C-M-&lt;left&gt;" . previous-buffer)
            ("C-M-b" . switch-to-buffer)
            ("C-M-k" . kill-buffer)
            ("C-M-l" . list-buffers)
            ("C-M-s" . save-buffer)
            ("C-M-0" . delete-window)
            ("C-M-1" . delete-other-windows)
            ("C-M-2" . split-window-below)
            ("C-M-3" . split-window-right)
            ("C-M-o" . other-window)
            ("C-M-}" . enlarge-window-horizontally)
            ("C-M-{" . shrink-window-horizontally)
            ("C-M-]" . enlarge-window)
            ("C-M-[" . shrink-window))
</pre>
</div>
</div>
</div>

<div id="outline-container-org86dddf3" class="outline-2">
<h2 id="org86dddf3"><span class="section-number-2">12.</span> Help Me!</h2>
<div class="outline-text-2" id="text-12">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(bind-keys :prefix "C-h"
           :prefix-map help-map
           :prefix-docstring "Help me!"
           ("b" . describe-bindings)
           ("f" . describe-function)
           ("i" . info)
           ("k" . describe-key)
           ("l" . view-lossage)
           ("m" . describe-mode)
           ("v" . describe-variable)
           ("w" . where-is))
</pre>
</div>
</div>
</div>

<div id="outline-container-org11273b6" class="outline-2">
<h2 id="org11273b6"><span class="section-number-2">13.</span> Define Some Minibuffer Bindings</h2>
<div class="outline-text-2" id="text-13">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(bind-keys :map minibuffer-mode-map
           ("TAB" . minibuffer-complete)
           ("RET" . exit-minibuffer)
           ("M-n" . next-history-element)
           ("M-p" . previous-history-element)))
</pre>
</div>
</div>
</div>
