emacs_init.org
** Define Some Navigation Through a Project

#+BEGIN_SRC emacs-lisp :tangle init.el
  (bind-keys :map global-map
	     ("C-x `" . next-error))
#+END_SRC

** Configure Org Mode

#+BEGIN_SRC emacs-lisp :tangle init.el
   (use-package org
     :bind (:map org-mode-map
     ("DEL" . org-delete-backward-char)
     ("TAB" . org-cycle)
     ("M-RET" . org-meta-return)
     ("M-<right>" . org-metaright)
     ("M-<left>" . org-metaleft)
     ("C-a" . org-beginning-of-line)
     ("C-k" . org-kill-line)
     ("C-c C-w" . org-refile)
     ("C-c C-q" . org-set-tags-command)
     ("C-x RET" . org-open-at-point)))
#+END_SRC

** Configure Dired Mode

#+BEGIN_SRC emacs-lisp :tangle init.el
  (use-package dired
    :bind (:map dired-mode-map
    ("C-p" . dired-previous-line)
    ("C-n" . dired-next-line)
    ("RET" . dired-find-file)))
#+END_SRC

** Configure Org Agenda

#+BEGIN_SRC emacs-lisp :tangle init.el
  (use-package org-agenda
    :bind (:map org-agenda-mode-map
    ("C-n" . org-agenda-next-line)
    ("C-p" . org-agenda-previous-line)
    ("TAB" . org-agenda-goto)
    ("g" . org-agenda-redo-all)
    ("t" . org-agenda-todo)
    ("u" . org-agenda-bulk-unmark)
    ("T" . org-agenda-show-tags))
    :config
    (setq org-agenda-span 'day)
    ;; Allow for very old scheduled items for catch-up behavior.
    (setq org-scheduled-past-days 99999)
    ;; Use hl-line mode in org-agenda for visibilitiy
    (add-hook 'org-agenda-mode-hook 'hl-line-mode))
#+END_SRC

** Configure hexl Mode

#+BEGIN_SRC emacs-lisp :tangle init.el
    (use-package hexl
      :bind (:map hexl-mode
      ("C-v" . hexl-scroll-up)
      ("M-v" . hexl-scroll-down)))
#+END_SRC

** Configure Info Mode

#+BEGIN_SRC emacs-lisp :tangle init.el
  (use-package info
    :bind (:map Info-mode-map
    ("SPC" . Info-scroll-up)))
#+END_SRC

** Manage Environment for Called Commands

Some operating systems (such as OS X) will invoke Emacs with a
separate profile that may not include configuration that has been
defined for login sessions such as environment variables.

This basically steals the logic from exec-path-from-shell (to link)
but the code itself is a bit dumber and is more oriented towards
building out a larger code base rather than providing drop-in
functionality.

Most of the constructs here will be prefixed with `^-env` but those
that are more general will omit the `env` segment.

*** Customization Group

I have not used customize in the past, but in addition to providing a
user interface which may be more usable across devices it also seems
to offer a natural means to locally specialize behavior without
worrying about what goes into which file.

These will be functions which in some places helps reduce the overall
complexity while retaining flexibility, and others are done largely
for consistency. The large possible drawback is that this pushes more
power and required expertise to the user (but additional protections
and conveniences could be layered off if desired).

Initially funcall will be used fairly liberally until I stumble across
a means to identify variables as functions and push Emacs lisp closer
to a lisp 1 (I know such mechanisms are readily available but I'm just
not actively looking).

#+BEGIN_SRC emacs-lisp :tangle init.el

  (defgroup ^-env
    nil
    "Tune the environment."
    :prefix "^-env"
    :group 'environment)
#+END_SRC

*** Expand Using Shell

The underlying functionality revolves around evaluating expressions in
a shell which is invoked with the login profile. Much of this _may_ be
able to be further generalized but there's currently no clear path or
reason to do so.

At the high level such expansion will be done by wrapping the name as
a shell parameter and then passing it through the fairly ubiquitous
`printf` function.

#+BEGIN_SRC emacs-lisp :tangle init.el
  (defun ^-shell-expand (name)
    (let ((shell-variable (^-enveloper '("${" . "}"))))
      (^-shell-printf "%s" (funcall shell-variable name))))
#+END_SRC

**** Enveloper

The above uses an "enveloper" which wraps a string in the provided
pair. There's some similar behavior that seems worth extracting
into an object when I get to reading about some of the object
libraries in Emacs (it doesn't seem worth going the manual route of
routing messages).

This makes use of currying since...I like currying. More specifically
I think use of partial applications in local variables can provide
tidy invocations of general blocks. Later on I'll probably make use of
some library or other (dash?) to provide a range of functional
programming behavior for me.

#+BEGIN_SRC emacs-lisp :tangle init.el
  (defun ^-enveloper (pair)
    "Produce a function which will wrap a string within pair."
    (lambda (s) (concat (car pair) s (cdr pair))))
#+END_SRC

**** Define the Called Commands

***** Shell Supplier

The evaluation itself will be performed through a shell command which
is defined here, defaulting to the Emacs standard.

#+BEGIN_SRC emacs-lisp :tangle init.el
  (defcustom ^-env-shell-supplier
    (lambda () shell-file-name)
    "Define the function which will return the shell to invoke
     along with any additional arguments."
    :type 'function
    :group '^-env)
#+END_SRC

***** Shell Login Argument Supplier

The shell command may also require some additional arguments to make
sure that it is executed using the login profile.

#+BEGIN_SRC emacs-lisp :tangle init.el
  (defcustom ^-env-shell-login-arg-supplier
    (lambda () '("-l" "-i"))
    "Define the function which will return arguments that when
     passed to the shell will operate in login mode."
    :type 'function
    :group '^-env)
#+END_SRC

***** Printf Command Supplier

As previously mentioned this will expect to be evaluated using some
form of printf...how practically extensible this is given the current
logic seems unclear - likely most of these functions would be better
off as being passed the argument they're expanding but all of that
feels like premature generalization and right now the goal is just to
define some of the magic values.

#+BEGIN_SRC emacs-lisp :tangle init.el
  (defcustom ^-env-printf-supplier
    (lambda () "printf")
    "Define the function which will return the printf command
     to be invoked by the shell."
    :type 'function
    :group '^-env)
#+END_SRC

**** Support Invoking the Commands

There's likely some better constructs for this floating around
somewhere, but for now I'll start with what was inherited.

