emacs_init.html

<div id="outline-container-org6bc0e90" class="outline-2">
<h2 id="org6bc0e90"><span class="section-number-2">14.</span> Define Some Navigation Through a Project</h2>
<div class="outline-text-2" id="text-14">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(bind-keys :map global-map
           ("C-x `" . next-error))
</pre>
</div>
</div>
</div>

<div id="outline-container-org8f8599c" class="outline-2">
<h2 id="org8f8599c"><span class="section-number-2">15.</span> Configure Org Mode</h2>
<div class="outline-text-2" id="text-15">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package org
  :bind (:map org-mode-map
  ("DEL" . org-delete-backward-char)
  ("TAB" . org-cycle)
  ("M-RET" . org-meta-return)
  ("M-&lt;right&gt;" . org-metaright)
  ("M-&lt;left&gt;" . org-metaleft)
  ("C-a" . org-beginning-of-line)
  ("C-k" . org-kill-line)
  ("C-c C-w" . org-refile)
  ("C-c C-q" . org-set-tags-command)
  ("C-x RET" . org-open-at-point)))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgff24eb4" class="outline-2">
<h2 id="orgff24eb4"><span class="section-number-2">16.</span> Configure Dired Mode</h2>
<div class="outline-text-2" id="text-16">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package dired
  :bind
  ("C-p" . dired-previous-line)
  ("C-n" . dired-next-line)
  ("RET" . dired-find-file))
</pre>
</div>
</div>
</div>

<div id="outline-container-org4cef713" class="outline-2">
<h2 id="org4cef713"><span class="section-number-2">17.</span> Configure Org Agenda</h2>
<div class="outline-text-2" id="text-17">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package org-agenda
  :bind
  ("C-n" . org-agenda-next-line)
  ("C-p" . org-agenda-previous-line)
  ("TAB" . org-agenda-goto)
  ("g" . org-agenda-redo-all)
  ("t" . org-agenda-todo)
  ("u" . org-agenda-bulk-unmark)
  ("T" . org-agenda-show-tags)
  :config
  (setq org-agenda-span 'day)
  ;; Allow for very old scheduled items for catch-up behavior.
  (setq org-scheduled-past-days 99999)
  ;; Use hl-line mode in org-agenda for visibilitiy
  (add-hook 'org-agenda-mode-hook 'hl-line-mode))
</pre>
</div>
</div>
</div>

<div id="outline-container-org6d7ebd1" class="outline-2">
<h2 id="org6d7ebd1"><span class="section-number-2">18.</span> Configure hexl Mode</h2>
<div class="outline-text-2" id="text-18">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package hexl
  :bind
  ("C-v" . hexl-scroll-up)
  ("M-v" . hexl-scroll-down))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf960c05" class="outline-2">
<h2 id="orgf960c05"><span class="section-number-2">19.</span> Configure Info Mode</h2>
<div class="outline-text-2" id="text-19">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package info
  :bind
  ("SPC" . Info-scroll-up))    
</pre>
</div>
</div>
</div>

<div id="outline-container-org4cb938e" class="outline-2">
<h2 id="org4cb938e"><span class="section-number-2">20.</span> Manage Environment for Called Commands</h2>
<div class="outline-text-2" id="text-20">
<p>
Some operating systems (such as OS X) will invoke Emacs with a
separate profile that may not include configuration that has been
defined for login sessions such as environment variables.
</p>

<p>
This basically steals the logic from exec-path-from-shell (to link)
but the code itself is a bit dumber and is more oriented towards
building out a larger code base rather than providing drop-in
functionality.
</p>

<p>
Most of the constructs here will be prefixed with `<sup>-env</sup>` but those
that are more general will omit the `env` segment.
</p>
</div>

<div id="outline-container-orgb56d76e" class="outline-3">
<h3 id="orgb56d76e"><span class="section-number-3">20.1.</span> Customization Group</h3>
<div class="outline-text-3" id="text-20-1">
<p>
I have not used customize in the past, but in addition to providing a
UI which may be more usable across devices it also seems to offer a
natural means to locally specialize behavior without worrying about
what goes into which file.
</p>

<p>
These will be functions which in some places helps reduce the overall
complexity while retaining flexibility, and others are done largely
for consistency. The large possible drawback is that this pushes more
power and required expertise to the user (but additional protections
and conveniences could be layered off if desired).
</p>

<p>
Initially funcall will be used fairly liberally until I stumble across
a means to identify variables as functions and push Emacs lisp closer
to a lisp 1 (I know such mechanisms are readily available but I'm just
not actively looking).
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
(defgroup ^-env
  nil
  "Tune the environment."
  :prefix "^-env"
  :group 'environment)
</pre>
</div>
</div>

<div id="outline-container-org388b67e" class="outline-4">
<h4 id="org388b67e"><span class="section-number-4">20.1.1.</span> Expand Using Shell</h4>
<div class="outline-text-4" id="text-20-1-1">
<p>
The underlying functionality revolves around evaluating expressions in
a shell which is invoked with the login profile. Much of this <span class="underline">may</span> be
able to be further generalized but there's currently no clear path or
reason to do so.
</p>

<p>
At the high level such expansion will be done by wrapping the name as
a shell parameter and then passing it through the fairly ubiquitous
`printf` function.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(defun ^-shell-expand (name)
  (let ((shell-variable (^-enveloper '("${" . "}"))))
    (^-shell-printf "%s" (funcall shell-variable name))))
</pre>
</div>
</div>

<ol class="org-ol">
<li><a id="orgcfdcd07"></a>Enveloper<br />
<div class="outline-text-5" id="text-20-1-1-1">
<p>
The above uses an "enveloper" which wraps a string in the provided
pair. There's some similar behavior that seems worth extracting
into an object when I get to reading about some of the object
libraries in Emacs (it doesn't seem worth going the manual route of
routing messages).
</p>

<p>
This makes use of currying since&#x2026;I like currying. More specifically
I think use of partial applications in local variables can provide
tidy invocations of general blocks. Later on I'll probably make use of
some library or other (dash?) to provide a range of functional
programming behavior for me.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(defun ^-enveloper (pair)
  "Produce a function which will wrap a string within pair."
  (lambda (s) (concat (car pair) s (cdr pair))))
</pre>
</div>
</div>
</li>

<li><a id="org42f378a"></a>Define the Called Commands<br />
<ol class="org-ol">
<li><a id="orgf2e3b3b"></a>Shell Supplier<br />
<div class="outline-text-6" id="text-20-1-1-2-1">
<p>
The evaluation itself will be performed through a shell command which
is defined here, defaulting to the Emacs standard.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(defcustom ^-env-shell-supplier
  (lambda () shell-file-name)
  "Define the function which will return the shell to invoke
   along with any additional arguments."
  :type 'function
  :group '^-env)
</pre>
</div>
</div>
</li>

<li><a id="orgb0190f7"></a>Shell Login Argument Supplier<br />
<div class="outline-text-6" id="text-20-1-1-2-2">
<p>
The shell command may also require some additional arguments to make
sure that it is executed using the login profile.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(defcustom ^-env-shell-login-arg-supplier
  (lambda () '("-l" "-i"))
  "Define the function which will return arguments that when
   passed to the shell will operate in login mode."
  :type 'function
  :group '^-env)
</pre>
</div>
</div>
</li>

<li><a id="org4262e91"></a>Printf Command Supplier<br />
<div class="outline-text-6" id="text-20-1-1-2-3">
<p>
As previously mentioned this will expect to be evaluated using some
form of printf&#x2026;how practically extensible this is given the current
logic seems unclear - likely most of these functions would be better
off as being passed the argument they're expanding but all of that
feels like premature generalization and right now the goal is just to
define some of the magic values.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(defcustom ^-env-printf-supplier
  (lambda () "printf")
  "Define the function which will return the printf command
   to be invoked by the shell."
  :type 'function
  :group '^-env)
</pre>
</div>
</div>
</li>
</ol>
</li>

<li><a id="org1b8eb3f"></a>Support Invoking the Commands<br />
<div class="outline-text-5" id="text-20-1-1-3">
<p>
There's likely some better constructs for this floating around
somewhere, but for now I'll start with what was inherited.
</p>
</div>

<ol class="org-ol">
