emacs_init.org
***** Warn On Slow Evaluation

Warning on a slow call is carried forward from exec-from-shell...I'm
not entirely sure of its value given that there's no timeout behavior
and the execution is not typically done repeatedly.  I'd conjecture
that maybe this is useful as such slow executions could produce
undesirably slow Emacs start times. In any case it seems worth keeping
around for the time being.

#+BEGIN_SRC emacs-lisp :tangle init.el
  (defcustom ^-env-warn-evaluation-duration-millis-supplier
    (lambda () 500)
    "Print a warning if evaluation duration exceeds this number of milliseconds."
    :type 'function
    :group '^-env)
#+END_SRC

***** Support Timed Evaluation

There's nothing particularly specialized about timing a call so this
will be implemented through providing a first class function which
takes a curried handler to which the time will be passed and can then
be passed any body as a thunk which will be evaluated and timed.
This would almost certainly be more idiomatically a macro in Emacs
lisp but I tend to avoid that (which will be covered separately at
some point).

The implementation is typical timer behavior of tracking start time
and then reporting the difference between the start and end times (in
this case passing it to the handler. A general note (not specific to
this code or language) is that it is often desirable to consistently
report the time and therefore any calls that return through alternate
paths (such as exceptions) should also be tracked (and preferably
annotated accordingly). This is optimistically ignored for this code
(and I'd typically prefer Either semantics over exceptions which makes
that issue simpler to reason about) but that scenario may need further
attention with this code.

****** Millisecond Duration

The duration will be passed in milliseconds as that's what's inherited
from the original logic. This also generally seems to be the most
common unit for timing application code - it is appropriate for
relatively slow actions like invoking another process and faster
actions can be timed in aggregates which can help smooth out the many
things can skew sub-millisecond timings.

This provides a basic implementation to calculate such a duration
from two timestamps using Emacs functionality. There may be a
date/time library floating around that could replace this later.

#+BEGIN_SRC emacs-lisp :tangle init.el
  (defun ^-temporal-diff-millis (start end)
    (thread-last start
		(time-subtract end)
		float-time
		(* 1000.0)))
#+END_SRC

****** Implement Timer

This function body is a fairly straightforward higher-order
function. Currently the handler will be invoked with ~funcall~ (which
should be modified later).

#+BEGIN_SRC emacs-lisp :tangle init.el
  (defun ^-timed (handler)
    "Produce a function that will invoke thunks and return their value
     while also passing the execution duration to <handler>."
    (lambda (thunk)
      (let* ((start-time (current-time))
	     (result (funcall thunk))
	     (duration (^-temporal-diff-millis start-time (current-time))))
	(funcall handler duration)
	result)))
#+END_SRC

****** Wire Warning

The specific handler for the duration warning needs to be configured
to be plugged into the general timer. This will be provided by a
closure over the setting which returns an appropriate handler.

**** Transplants

The environment variables that should be carried across profiles will
be called "transplants".

#+BEGIN_SRC emacs-lisp :tangle init.el
  (defcustom ^-env-variable-transplants-supplier
    (lambda '("MANPATH"))
    "List of environment variables which will be transplanted on initialization."
    :group '^-env)
#+END_SRC


#  LocalWords:  Minibuffer Dired hexl
