emacs_init.html
<li><a id="orga877989"></a>Warn On Slow Evaluation<br />
<div class="outline-text-6" id="text-20-1-1-3-1">
<p>
Warning on a slow call is carried forward from exec-from-shell&#x2026;I'm
not entirely sure of its value given that there's no timeout behavior
and the execution is not typically done repeatedly.  I'd conjecture
that maybe this is useful as such slow executions could produce
undesirably slow Emacs start times. In any case it seems worth keeping
around for the time being.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(defcustom ^-env-warn-evaluation-duration-millis-supplier
  (lambda () 500)
  "Print a warning if evaluation duration exceeds this number of milliseconds."
  :type 'function
  :group '^-env)
</pre>
</div>
</div>
</li>

<li><a id="org123ac0a"></a>Support Timed Evaluation<br />
<div class="outline-text-6" id="text-20-1-1-3-2">
<p>
There's nothing particularly specialized about timing a call so this
will be implemented through providing a first class function which
takes a curried handler to which the time will be passed and can then
be passed any body as a thunk which will be evaluated and timed.
This would almost certainly be more idiomatically a macro in Emacs
lisp but I tend to avoid that (which will be covered separately at
some point).
</p>

<p>
The implementation is typical timer behavior of tracking start time
and then reporting the difference between the start and end times (in
this case passing it to the handler. A general note (not specific to
this code or language) is that it is often desirable to consistently
report the time and therefore any calls that return through alternate
paths (such as exceptions) should also be tracked (and preferably
annotated accordingly). This is optimistically ignored for this code
(and I'd typically prefer Either semantics over exceptions which makes
that issue simpler to reason about) but that scenario may need further
attention with this code.
</p>
</div>

<ol class="org-ol">
<li><a id="org3044a30"></a>Millisecond Duration<br />
<div class="outline-text-7" id="text-20-1-1-3-2-1">
<p>
The duration will be passed in milliseconds as that's what's inherited
from the original logic. This also generally seems to be the most
common unit for timing application code - it is appropriate for
relatively slow actions like invoking another process and faster
actions can be timed in aggregates which can help smooth out the many
things can skew sub-millisecond timings.
</p>

<p>
This provides a basic implementation to calculate such a duration
from two timestamps using Emacs functionality. There may be a
date/time library floating around that could replace this later.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(defun ^-temporal-diff-millis (start end)
  (thread-last start
              (time-subtract end)
              float-time
              (* 1000.0)))
</pre>
</div>
</div>
</li>

<li><a id="orgb12c927"></a>Implement Timer<br />
<div class="outline-text-7" id="text-20-1-1-3-2-2">
<p>
This function body is a fairly straightforward higher-order
function. Currently the handler will be invoked with funcall (which
should be modified later).
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(defun ^-timed (handler)
  "Produce a function that will invoke thunks and return their value
   while also passing the execution duration to &lt;handler&gt;."
  (lambda (thunk)
    (let* ((start-time (current-time))
           (result (funcall thunk))
           (duration (^-temporal-diff-millis start-time (current-time))))
      (funcall handler duration)
      result)))
</pre>
</div>
</div>
</li>

<li><a id="org80f4bda"></a>Wire Warning<br />
<div class="outline-text-7" id="text-20-1-1-3-2-3">
<p>
The specific handler for the duration warning 
</p>
</div>
</li>
</ol>
</li>
</ol>
</li>
</ol>
</div>

<div id="outline-container-orgadb7876" class="outline-4">
<h4 id="orgadb7876"><span class="section-number-4">20.1.2.</span> Transplants</h4>
<div class="outline-text-4" id="text-20-1-2">
<p>
The environment variables that should be carried across profiles will
be called "transplants".
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(defcustom ^-env-variable-transplants-supplier
  (lambda '("MANPATH"))
  "List of environment variables which will be transplanted on initialization."
  :group '^-env)
</pre>
</div>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2023-06-16 Fri 12:37</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>